Repository: AndreiZhitkov/quiz-tool-lite
Catalog: languages/qtl-*.po
Languages: el, sl_si

source: These responses are shown in a random order
el: Αυτές οι απαντήσεις εμφανίζονται με τυχαία σειρά
sl_si: Ti odgovori so prikazani v naključnem vrstnem redu

source: Switch to manual ordering
el: Μετάβαση σε χειροκίνητη ταξινόμηση
sl_si: Preklopi na ročno urejanje

source: These responses are displayed in the order shown below
el: Αυτές οι απαντήσεις εμφανίζονται με τη σειρά που φαίνεται παρακάτω
sl_si: Ti odgovori so prikazani v vrstnem redu prikazanim spodaj

source: Switch to random ordering
el: Μετάβαση σε τυχαία ταξινόμηση
sl_si: Preklopi na ročno urejanje

source: Correct Answer
el: Σωστή Απάντηση
sl_si: Pravilen odgovor

source: Yes, delete this response
el: Ναι, διαγραφή αυτής της απάντησης
sl_si: Da, zbriši ta odgovor

source: Question Preview
el: Προεπισκόπηση ερωτήματος
sl_si: Predogled vprašanja

source: Answers are not case sensitive. Separate each valid answer with a comma e.g. "red, yellow"
el: Στις απαντήσεις δεν γίνεται διάκριση πεζών-κεφαλαίων. Διαχωρίστε κάθε έγκυρη απάντηση με κόμμα π.χ. "κόκκινο κίτρινο"
sl_si: Odgovori niso pogojeni z rabo velikih ali malih črk. Loči vsak veljaven odgovor z vejico npr "rdeča, rumena"

source: Blank
el: Κενό
sl_si: Prazno mesto

source: answers
el: απαντήσεις
sl_si: odgovori

source: correct feedback
el: ανατροφοδότηση για σωστή απάντηση
sl_si: pravilna povratna informacija

source: Possible answer:
el: Πιθανή απάντηση:
sl_si: Možen odgovor:

source: The feedback shown next to this response if answered correctly
el: Η ανατροφοδότηση που εμφανίζεται δίπλα σε αυτήν την απάντηση αν απαντηθεί σωστά
sl_si: Povratna informacija prikazana poleg tega odgovora, če je odgovorjeno pravilno

source: The feedback shown next to this response if answered incorrectly
el: Η ανατροφοδότηση που εμφανίζεται δίπλα σε αυτήν την απάντηση, αν απαντηθεί λανθασμένα
sl_si: Povratna informacija prikazana poleg tega odgovora, če je odgovorjeno nepravilno

source: Create questions and quizzes, embed individual questions for formative assessment or deploy entire an quiz
el: Δημιουργήστε ερωτήσεις και τεστ, ενσωματώστε μεμονωμένες ερωτήσεις για διαμορφωτική αξιολόγηση ή ολόκληρο τεστ
sl_si: Ustvari vprašanja in teste, vključi posamezna vprašanja za oblikovalno ovrednotenje ali uporabi cel test

source: Alex Furr, Lisha Chen Wilson and Simon Ward
el: Alex Furr, Lisha Chen Wilson και Simon Ward

source: Optional. Leave blank to return to current page)
el: Προαιρετικό. Αφήστε κενό για να επιστρέψετε στην τρέχουσα σελίδα)

source: View results
el: Προβολή αποτελεσμάτων

source: Email Settings (optional)
el: Ρυθμίσεις Email

source: Score:
el: Βαθμολογία:

source: Send Quiz Email Address from this address:
el: Αποστολή email τεστ από αυτή τη διεύθυνση:

source: Total number of correct anwers:
el: Συνολικός αριθμός σωστών απαντήσεων:

source: Your score on this attempt:
el: Η βαθμολογία σας σε αυτή τη προσπάθεια:

source: Are you sure you want to delete the question pot
el: Είστε σίγουρος/η πως θέλετε να διαγράψετε την τράπεζα απαντήσεων

source: Options
el: Επιλογές

source: Are you sure you want to delete question
el: Είστε σίγουρος/η πως θέλετε να διαγράψετε την ερώτηση

source: Are you sure you want to delete the question pot<br>
el: Είστε σίγουρος/η πως θέλετε να διαγράψετε την τράπεζα ερωτήσεων;<br>

source: This will delete all questions in this pot and cannot be undone!</span><br/><br/>
el: Αυτή η ενέργεια θα διαγράψει όλες τις ερωτήσεις σε αυτή την τράπεζα θεμάτων και δεν μπορεί να αναιρεθεί!</span><br/><br/>

source: Quiz Deleted
el: Το τεστ έχει διαγραφεί

source: Are you sure you want to delete quiz:
el: Είστε σίγουρος/η πως θέλετε να διαγράψετε το τεστ:

source: Question Listqtl
el: Λίστα ερωτήσεων

source: This quiz will submit in:<br/>
el: Αυτό το τεστ θα υποβληθεί σε:<br/>

source: Pick a different quiz
el: Επιλογή διαφορετικού τεστ

source: Shortcode
sl_si: Koda
