Repository: AndreiZhitkov/quiz-tool-lite
Catalog: languages/qtl-*.po
Languages: el, sl_si

source: Edit Boundary
el: Επεξεργασία ορίου
sl_si: Uredi ločnice

source: Return to my boundaries
el: Επιστροφή των ορίων
sl_si: Vrni se na moje ločnice

source: Minimum Score
el: Μέγιστη βαθμολογία

source: Maximum Score
el: Ελάχιστη βαθμολογία
sl_si: Najvišji rezultat

source: Feedback to display
el: Ανατροφοδότηση προς προβολή
sl_si: Prikaz povratnih informacij

source: Update
el: Ενημέρωση
sl_si: Posodobitev

source: Export / Import
el: Εισαγωγή / Εξαγωγή
sl_si: Izvoz / Uvoz

source: Export Questions
el: Εξαγωγή Ερωτήσεων
sl_si: Izvozi vprašanja

source: Export Questions as CSV
el: Εξαγωγή Ερωτήσεων ως CSV
sl_si: Izvozi vprašanja kot CVS

source: Import Questions
el: Εισαγωγή Ερωτήσεων
sl_si: Uvozi vprašanja

source: Upload your CSV import file.
el: Μεταφόρτωση αρχείου CSV.
sl_si: Naloži svojo CSV uvozno datoteko.

source: Range Deleted
el: Το εύρος έχει διαγραφεί
sl_si: Razpon izbrisan

source: Add new grade range
el: Προσθήκη νέος εύρους βαθμολογιας
sl_si: Dodaj nov razpon ocen

source: Grade Boundaries
el: Όρια βαθμολογίας
sl_si: Ločnice ocen

source: Back to Quiz List
el: Πίσω στην λίστα τεστ
sl_si: Nazaj na seznam testov

source: Grade Range
el: Όρια Βαθμολογίας
sl_si: Razpon ocen

source: Feedback
el: Ανατροφοδότηση
sl_si: Povratne informacije

source: No range defined
el: Δεν έχει οριστεί εύρος
sl_si: Ni definiranega razpona

source: Edit
el: Επεξεργασία
sl_si: Uredi

source: Delete
el: Διαγραφή
sl_si: Izbriši

source: Are you sure you want to delete this grade range?
el: Είστε σίγουρος/η πως θέλετε να διαγράψετε αυτό το εύρος βαθμολογίας;
sl_si: Ste prepričani, da hočete zbrisati ta razpon ocen?

source: Yes
el: Ναι
sl_si: Da

source: Cancel
el: Άκυρο
sl_si: Prekliči

source: No feedback given
el: Δεν έχει δοθεί ανατροφοδότηση
sl_si: Ni povratnih informacij

source: Undefined Boundary
el: Μη ορισμένο όριο
sl_si: Nedefinirana ločnica

source: Help
el: Βοήθεια
sl_si: Pomoč

source: Question Pots
el: Τράπεζα Ερωτήσεων
sl_si: Sklopi vprašanj

source: Create a new question pot
el: Δημιουργία νέας τράπεζας ερωτήσεων
sl_si: Ustvari sklop vprašanj

source: Enter Quiz Name
el: Εισάγετε όνομα τεστ
sl_si: Vnesi ime testa

source: Pot Name
el: Όνομα τράπεζας ερωτήσεων
sl_si: Ime sklopa

source: Number of questions
el: Αριθμός ερωτήσεων
sl_si: Število vprašanj

source: Add or edit questions
el: Προσθήκη ή επεξεργασία ερωτήσεων
sl_si: Dodaj ali uredi vprašanja

source: Change Pot Name
el: Αλλαγή ονόματος τράπεζας ερωτήσεων
sl_si: Spremeni ime sklopa

source: Are you sure you want to delete this question pot?
el: Είστε σίγουρος/η πως θέλετε να διαγράψετε αυτή τη τράπεζα ερωτήσεων;
sl_si: Ste prepričani, da želite izbrisati ta sklop vprašanj?

source: This will delete all questions in this pot and cannot be undone!
el: Αυτή η ενέργεια θα διαγράψει όλες τις ερωτήσεις από αυτή την τράπεζα ερωτήσεων και δεν μπορεί να αναιρεθεί!
sl_si: To bo zbrisalo vsa vprašanja v tem sklopu in ne more biti razveljavljeno!

source: Yes, delete this question pot
el: Ναι, διαγραφή αυτής της τράπεζας ερωτήσεων
sl_si: Da, izbriši ta sklop vprašanj

source: Welcome to Quiz Tool Lite
el: Καλώς ήρθατε στο Quiz Tool Lite
sl_si: Dobrodošli k Quiz Tool Lite

source: All questions you create need to be within a question "pot, e.g. "Maths Questions" or "Difficult Questions"<br/><br/>Create a question pot by clicking the button above.
el: Όλες οι ερωτήσεις που δημιουργείτε πρέπει να βρίσκονται σε μια τράπεζα ερωτήσεων π.χ. "Ερωτήσεις Μαθηματικών" ή "Δύσκολες Ερωτήσεις"<br/><br/>Δημιουργήστε μια τράπεζα ερωτήσεων επιλέγοντας το παραπάνω κουμπί.
sl_si: Vsa ustvarjena vprašanja morajo biti znotraj posameznega sklopa vprašanj, npr. "matematična vprašanja" ali "zahtevna vprašanja" <br><br>Sklop vprašanj ustvari s klikom zgornjega gumba.

source: For more information and help please read the <a href="admin.php?page=ai-quiz-help">help pages</a> or visit the <a href="https://wordpress.org/support/plugin/quiz-tool-lite">support forum</a>
el: Για περισσότερες πληροφορίες ανατρέξτε στις σελίδες <a href="admin.php?page=ai-quiz-help">βοήθειας</a>
sl_si: Za več informacij in pomoč prosim preberite <a href="admin.php?page=ai-quiz-help"> strain za pomoč </a> ali obiščite <a href="https://wordpress.org/support/plugin/quiz-tool-lite"> forum za podporo</a>

source: Option updated
el: Η επιλογή έχει ενημερωθεί
sl_si: Možnost posodobljena

source: Option deleted
el: Η επιλογή έχει διαγραφεί
sl_si: Možnost zbrisana

source: Correct Feedback
el: Ανάδραση για σωστή απάντηση
sl_si: Pravilne povratne informacije

source: Text to display after click
el: Κείμενο για προβολή μετά το κλικ
sl_si: Besedilo za prikaz po kliku

source: Save
el: Αποθήκευση
sl_si: Shrani

source: Save and continue
el: Αποθήκευση και συνέχεια
sl_si: Shrani in nadaljuj

source: Edit Question
el: Επεξεργασία Ερώτησης
sl_si: Uredi vprašanje

source: Return to pot:
el: Επιστροφή στην τράπεζα ερωτήσεων:
sl_si: Vrni se na sklop vprašanj:

source: Question
el: Ερώτηση
sl_si: Vprašanje

source: Response Options
el: Επιλογές απαντήσεων
sl_si: Možnosti odgovora

source: Question Text
el: Κείμενο Ερώτησης
sl_si: Besedilo vprašanja

source: To create your blank text boxes, type out your question and then replace each word you wish to replace with "[blank]"
el: Για να δημιουργήσετε τα δικά σας κενά κουτιά, πληκτρολογήστε την ερώτηση και μετά αντικαταστήστε την κάθε λέξη που θέλετε να αντικατασταθεί με "[blank]"
sl_si: Da bi ustvarili prazne okvirčke, vpišite svoje vprašanje in nadomestite vsako besedo, ki jo želite nadomestiti s "prazen prostor"

source: e.g. That's one small step for a [blank], one giant leap for [blank]
el: π.χ. Αυτό είναι ένα μικρό βήμα για τον [blank], ένα γιγαντιαίο άλμα για την [blank]
sl_si: To je majhen korak za [blank], velik korak za [prazen prostor]

source: Incorrect Feedback
el: Ανατροφοδότηση για λάθος απάντηση
sl_si: Nepravilne povratne informacije

source: Possible Answers
el: Πιθανές Απαντήσεις
sl_si: Možni odgovori

source: Please <b>save</b> this question before entering response options
el: Παρακαλώ <b>αποθηκεύστε</b> αυτή την ερώτηση πριν εισάγετε επιλογές απάντησης
sl_si: Prosim shranite to vprašanje preden vnesete možne odgovore

source: Add a new question
el: Προσθήκη νέας ερώτησης
sl_si: Dodaj novo vprašanje

source: Return to all question pots
el: Επιστροφή σε όλες τις τράπεζες ερωτήσεων
sl_si: Vrni se na vse sklope vprašanj

source: Please select a question type.
el: Παρακαλώ επιλέξτε τύπο ερώτησης.
sl_si: Prosim izberi tip vprašanja

source: Multiple Choice
el: Πολλαπλής Επιλογής
sl_si: Vprašanja z več možnimi odgovori

source: Text
el: Κείμενο
sl_si: Besedilo

source: Reflective
el: Κρίσεως
sl_si: Opis

source: Single Answer (radio buttons)
el: Μονής απάντησης (κουμπιά radio)
sl_si: Enojni odgovor

source: Multiple Answer (check boxes)
el: Πολλαπλών απαντήσεων (κουμπιά checkbox)
sl_si: Več možnih odgovorov

source: Free Text
el: Ελεύθερο Κείμενο
sl_si: Prosti tekst

source: Fill in the blanks
el: Συμπλήρωση κενών
sl_si: Dopolni manjkajoča mesta

source: Reflective questions are not marked - instead, answers can be saved and displayed to students on a seperate page.<br/> See the <a href="admin.php?page=ai-quiz-help#shortcodes">shortcode reference</a> for help with this.
el: Οι ερωτήσεις κρίσεως δεν βαθμολογούνται - αντ' αυτού, οι απαντήσεις μπορούν να αποθηκευτούν και να προβληθούν στους εξεταζόμενους σε ξεχωριστή σελίδα.<br/> Δείτε την <a href="admin.php?page=ai-quiz-help#shortcodes">επισκόπηση των shortcodes</a>για βοήθεια με αυτό.
sl_si: Opisna vprašanja niso ocenjena - toda vprašanja se lahko shranijo in prikažejo študentu na ločeni strain. <br/> Oglej si <a href="admin.php?page=ai-quiz-help#shortcodes">referenčno kodo</a> za pomoč.

source: Reflection (no textbox)
el: Απάντηση
sl_si: Opis (brez okvirja)

source: Settings
el: Ρυθμίσεις
sl_si: Nastavitve

source: This will copy the question to the current question pot
el: Αυτό θα αντιγράψει την ερώτηση στην τρέχουσα τράπεζα ερωτήσεων
sl_si: To bo kopiralo vprašanje v trenutni sklop

source: Question Deleted
el: Η ερώτηση έχει διαγραφεί
sl_si: Vprašanje izbrisano

source: Question copied succesfully
el: Η ερώτηση έχει αντιγραφεί επιτυχώς
sl_si: Vprašanje kopirano uspešno

source: No questions found
el: Δεν βρέθηκαν ερωτήσεις
sl_si: Nobenih najdenih vprašanj

source: Copy
el: Αντιγραφή
sl_si: Kopiraj

source: Select destination question pot
el: Επιλέξτε την τράπεζα ερωτήσεων προορισμόυ
sl_si: Izberi končni slop vprašanj

source: Copy question
el: Αντιγραφή ερώτησης
sl_si: Kopiraj vprašanje

source: Are you sure you want to delete question
el: Είστε σίγουρος/η πως θέλετε να διαγράψετε την ερώτηση
sl_si: Ste prepričani, da hočete zbrisati to vprašaanje

source: Yes, delete this question
el: Ναι διαγραφή αυτής της ερώτησης
sl_si: Da, zbriši to vprašanje

source: Correct
el: Σωστά
sl_si: Pravilno

source: Incorrect
el: Λάθος
sl_si: Nepravilno

source: Quiz updated
el: Το τεστ έχει ενημερωθεί
sl_si: Test posodobljen

source: Edit Quiz
el: Επεξεργασία τεστ
sl_si: Uredi test

source: Overview
el: Επισκόπηση
sl_si: Pregled

source: Participation
el: Συμμετοχή
sl_si: Sodelovanje

source: Quiz Name
el: Όνομα τεστ
sl_si: Ime testa

source: Select Questions for this Quiz
el: Επιλογή ερωτήσεων για αυτό το τεστ
sl_si: Izberi vprašanja za ta test

source: Add questions from pots
el: Προσθήκη ερωτήσεων από τράπεζα ερωτήσεων
sl_si: Dodaj vprašanja iz sklopov

source: Add questions from list
el: Προσθήκη ερωτήσεων από λίστα
sl_si: Dodaj vprašanja s seznama

source: Warning! The following questions do not exist:
el: Προσοχή! Οι ακόλουθες ερωτήσεις δεν υπάρχουν:
sl_si: Opozorilo! Sledeča vprašanja ne obstajajo:

source: Warning! The following questions are reflective types and therefore cannot be marked:
el: Προσοχή! Οι ακόλουθες ερωτήσεις είναι ερωτήσεις κρίσεως και δεν μπορούν να βαθμολογηθούν:
sl_si: Opozorilo! Sledeča vprašanja so opisnega tipa in ne morejo biti ocenjena:

source: Randomise questions
el: Ανακάτεμα ερωτήσεων
sl_si: Naključno izberi vprašanja

source: questions from this pot
el: ερωτήσεις από αυτήν την τράπεζα ερωτήσεων
sl_si: vprašanja iz tega sklopa

source: Availability
el: Διαθεσιμότητα
sl_si: Razpoložljivost

source: Start Date
el: Ημερομηνία έναρξης
sl_si: Začetni datum

source: optional
el: προαιρετικό
sl_si: poljubno

source: End Date
el: Ημερομηνία λήξης
sl_si: Končni datum

source: Completion Options
el: Επιλογής ολοκλήρωσης
sl_si: Možnosti dokončanja

source: Message displayed to user after quiz has been submitted
el: Μήνυμα που προβάλλεται στον χρήστη μετά την υποβολή του τεστ
sl_si: Sporočilo prikazano uporabniku po predložitvi testa

source: Redirect URL after completing the quiz
el: URL ανακατεύθυνσης μετά την ολοκλήρωση του τεστ
sl_si: Preusmeri URL po končanju testa

source: Optional. Leave blank to return to current page
el: Προαιρετικό. Αφήστε κενό για επιστροφή στην τρέχουσα σελίδα
sl_si: Poljubno. Pusti prazno, da se vrneš na trenutno stran.

source: Email me when a participant has taken the quiz
el: Αποστολή Email όταν κάποιος εξεταζόμενος έχει ξεκινήσει το τεστ
sl_si: Pošlji mi e-pošto, ko sodelujoči opravi test

source: Time Limit
el: Όριο χρόνου
sl_si: Časovna omejitev

source: Add a time limit to this quiz
el: Προσθήκη ορίου χρόνου σε αυτό το τεστ
sl_si: Dodaj časovno omejitev temu testu

source: minutes
el: λεπτά
sl_si: minute

source: seconds
el: δευτερόλεπτα
sl_si: sekunde

source: After the time above the quiz will automatically submit
el: Αφού ο περάσει ο παραπάνω χρόνος το τεστ θα υποβληθεί αυτόματα
sl_si: Po izteku zgornjega časa bo test predložen avtomatsko

source: Feedback Options
el: Επιλογές Ανατροφοδότησης
sl_si: Možnosti povratnih informacij

source: Display detailed feedback to participants
el: Προβολή λεπτομερούς ανατροφοδότησης στους συμμετέχοντες
sl_si: Prikaži podrobne povratne informacije sodelujočim

source: Hide feedback from participants
el: Απόκρυψη ανατροφοδότησης από τους συμμετέχοντες
sl_si: Skrij povratne informacije pred sodelujočimi

source: Feedback Text
el: Κείμενο ανατροφοδότησης
sl_si: Povratne informacije

source: Correct Text
el: Κείμενο για σωστή απάντηση
sl_si: Pravilno besedilo

source: Incorrect Text
el: Κείμενο για λάθος απάντηση
sl_si: Nepravilno besedilo

source: Feedback Icons
el: Εικονίδια Ανατροφοδότησης
sl_si: Ikone za povratne informacije

source: Icon set
el: Σετ εικονιδίων
sl_si: Skupina ikon

source: No icons
el: Χωρίς εικόνιδια
sl_si: Brez ikon

source: Participant Options
el: Επιλογές συμμετοχής
sl_si: Možnosti sodelujočega

source: Participants must be logged in to take this quiz
el: Οι συμμετέχοντες πρέπει να συνδεθούν για να ξεκινήσουν αυτό το τεστ
sl_si: Sodelujoči morajo biti vpisani, da lahko rešijo test

source: All the options below are only applicable if you have ticked 'Require user to be logged in'
el: Όλες οι παρακάτω επιλογές ισχύουν μόνο αν έχετε ενεργοποιημένη την επιλογή "Απαίτηση χρήστη να συνδεθεί"
sl_si: Vse možnosti spodaj so uporabne samo, če ste označili "Uporabnik mora biti vpisan"

source: Max number of attempts
el: Μέγιστος αριθμός προσπαθειών
sl_si: Največje število poskusov

source: Email user their mark after completing the quiz
el: Αποστολή στο χρήστη του βαθμού μετά τη συμπλήρωση του τεστ
sl_si: Pošlji uporabniku oceno po opravljanju testa

source: No
el: Όχι
sl_si: Ne

source: Minimum time between attempts
el: Ελάχιστος χρόνος μεταξύ προσπαθειών
sl_si: Najkrajši čas med poskusi

source: Hour(s)
el: Ώρα(ες)
sl_si: Ura(e)

source: Day(s)
el: Ημέρα(ες)
sl_si: Dan (dnevi)

source: Update Quiz
el: Ενημέρωση τεστ
sl_si: Posodobi test

source: Quiz List
el: Λίστα τεστ
sl_si: Seznam testov

source: Add a new quiz
el: Προσθήκη νέου τεστ
sl_si: Dodaj nov test

source: Quiz deleted
el: Το τεστ έχει διαγραφεί
sl_si: Test zbrisan

source: Number of Participants
el: Αριθμός συμμετεχόντων
sl_si: Število sodelujočih

source: View Results
el: Προβολή Αποτελεσμάτων
sl_si: Oglej si rezultate

source: Delete Quiz
el: Διαγραφή τεστ
sl_si: Zbriši test

source: Are you sure you want to delete quiz:
el: Είστε σίγουρος/η πως θέλετε να διαγράψετε αυτό το τεστ:
sl_si: Ste prepričani, da hočete zbrisati ta test?

source: Yes, delete this quiz
el: Ναι να γίνει διαγραφή του τεστ
sl_si: Da, zbriši ta test

source: Create a quiz by clicking the button above
el: Δημιουργήστε ένα τεστ επιλέγοντας το παραπάνω κουμπί
sl_si: Ustvari test s klikom zgornjega gumba

source: Correct feedback box color
el: Χρώμα κουτιού ανατροφοδότησης για σωστή απάντηση
sl_si: Barva okvirja pravilne povratne informacije

source: Correct feedback text color
el: Χρώμα κειμένου ανατροφοδότησης για σωστή απάντηση
sl_si: Barva besedila pravilne povratne informacije

source: Incorrect feedback box color
el: Χρώμα κουτιού ανατροφοδότησης για λάθος απάντηση
sl_si: Barva okvirja nepravilne povratne informacije

source: Incorrect feedback text color
el: Χρώμα κειμένου ανατροφοδότησης για λάθος απάντηση
sl_si: Barva besedila nepravilne povratne informacije

source: Reflective feedback box color
el: Χρώμα κουτιού ανατροφοδότησης για απάντηση σε ερώτηση κρίσεως
sl_si: Barva okvirja opisne povratne informacije

source: Reflective feedback text color
el: Χρώμα κειμένου ανατροφοδότησης για απάντηση σε ερώτηση κρίσεως
sl_si: Barva besedila opisne povratne informacije

source: Settings updated
el: Οι ρυθμίσεις έχουν ενημερωθεί
sl_si: Nastavitve posodobljene

source: Feedback Text Sample
el: Δείγμα κειμένου ανατροφοδότησης
sl_si: Besedilni vzorec povratne informacije

source: Minimum level required to be able to edit quizzes
el: Ελάχιστο επίπεδο δικαιωμάτων για την επεξεργασία τεστ
sl_si: Za urejanje testov je potreben najnižji nivo.

source: Email Settings
el: Ρυθμίσεις Email
sl_si: Nastavitve e-pošte

source: Send Quiz emails from this address:
el: Αποστολή email σχετικών με τα τεστ από αυτή τη διεύθυνση:
sl_si: Pošlji e-poštni naslov testa iz tega naslova:

source: And from this name:
el: Και από αυτό το όνομα:
sl_si: In iz tega imena:

source: If left blank, emails will be sent from the default donotreply@yourdomain.com address.
el: Αν παραμείνει κενό, τα email θα αποστέλλονται από την προεπιλεγμένη διεύθυνση donotreply@yourdomain.com.
sl_si: Če ostane prazno, bo e-pošta poslana iz privzetega donotreply@yourdomain.com naslova.

source: Feedback color settings
el: Ρυθμίσεις χρωμάτων ανατροφοδότησης
sl_si: Nastavitve barve za povratne informacije

source: Reflective Feedback
el: Ανατροφοδότηση σε απάντηση ερώτησης κρίσεως
sl_si: Opisne povratne informacije

source: Update Options
el: Ενημέρωση Επιλογών
sl_si: Posodobi možnosti

source: Quiz Results
el: Αποτελέσματα τεστ
sl_si: Rezultati testa

source: Please note: Results are saved only for logged in users
el: Σημείωση: Τα αποτελέσματα αποθηκεύονται μόνο για συνδεδεμένους χρήστες
sl_si: Pomembno: Rezultati se hranijo samo za prijavljene uporabnike.

source: Name
el: Όνομα
sl_si: Ime

source: Username
el: Όνομα χρήστη
sl_si: Uporabniško ime

source: Role
el: Ρόλος
sl_si: Vloga

source: Highest Score
el: Υψηλότερη βαθμολογία
sl_si: Najvišji rezultat

source: Number of attempts
el: Αριθμός προσπαθειών
sl_si: Število poskusov

source: Back to user results
el: Επιστροφή στα αποτελέσματα χρήστη
sl_si: Nazaj na rezultate uporabnika

source: Attempt
el: Προσπάθεια
sl_si: Poskus

source: Attempt Date
el: Ημερομηνία προσπάθειας
sl_si: Datum poksusa

source: Time taken
el: Χρόνος
sl_si: Čas poskusa

source: Score
el: Βαθμολογία
sl_si: Rezultat

source: Breakdown
el: Ανάλυση
sl_si: Razčlenitev

source: Uninished
el: Δεν έχει ολοκληρωθεί
sl_si: Nedokončan

source: View Answers
el: Προβολή απαντήσεων
sl_si: Poglej odgovore

source: Select your Question or Quiz
el: Επιλέξτε την Ερώτηση ή το Τεστ σας
sl_si: Izberi svoje vprašanje ali test

source: No Quizzes found
el: Δεν έχουν βρεθεί τεστ
sl_si: Nobenih najdenih testov

source: This Quiz will show:
el: Αυτό το Τεστ θα εμφανίσει:
sl_si: Ta test bo prikazal:

source: Insert this quiz
el: Εισαγωγή αυτού του τεστ
sl_si: Vstavi ta test

source: There are no questions in this quiz.
el: Δεν υπάρχουν ερωτήσεις σε αυτό το τεστ.
sl_si: V tem testu ni vprašanj.

source: No questions found in this pot.
el: Δεν έχουν βρεθεί ερωτήσεις σε αυτή τη τράπεζα θεμάτων.
sl_si: V tem sklopu ni najdenih nobenih vprašanj.

source: Insert this question
el: Εισαγωγή αυτής της ερώτησης
sl_si: Vstavi to vprašanje

source: Quiz Questions
el: Ερωτήσεις τεστ
sl_si: Testna vprašanja

source: Quizzes
el: Τεστ
sl_si: Testi

source: Question List
el: Λίστα Ερωτήσεων
sl_si: Seznam vprašanj

source: Results
el: Αποτελέσματα
sl_si: Rezultati

source: User Results
el: Αποτελέσματα Χρηστών
sl_si: Rezultati uporabnika

source: Quiz Breakdown
el: Ανάλυση Τεστ
sl_si: Razčlenitev testa

source: Pick Question Type
el: Επιλέξτε τύπο Ερώτησης
sl_si: Izberi tip vprašanja

source: Edit Grade Boundary
el: Επεξεργασία ορίων βαθμολογίας
sl_si: Uredi ločnice ocen

source: The quiz is not available until
el: Αυτό το τεστ θα είναι διαθέσιμο μέχρι
sl_si: Ta test ni na voljo do

source: You need to login before you can take this quiz
el: Πρέπει να συνδεθείτε για να μπορέσετε να ξεκινήσετε αυτό το τεστ
sl_si: Morate se prijaviti preden lahko opravite test

source: The quiz closed on
el: Το τεστ έκλεισε στις
sl_si: Test končan

source: You can next take this test in
el: Μπορείτε να επαναλάβετε αυτό το τεστ σε
sl_si: Nalednjič lahko ta test opravljate

source: You have exceeded the number of maximum attmempts
el: Έχετε υπερβεί τον αριθμό των μέγιστων προσπαθειών
sl_si: Prekoračili ste število možnih poskusov

source: Total number of allowed attempts:
el: Συνολικός αριθμός επιτρεπόμενων προσπαθειών:
sl_si: Skupno število dovoljenih poskusov

source: Number of attempts remaining:
el: Αριθμός προσπαθειών που απομένουν:
sl_si: Število preostalih poskusov

source: <b>Please note</b>: Clicking 'refresh' or using the back or forward buttons on your browser after starting the quiz will count as another attempt.
el: <b>Σημείωση</b>: Κάνοντας κλικ στην επιλογή "ανανέωση" ή χρησιμοποιώντας τα κουμπιά "πίσω" ή "εμπρός" στο πρόγραμμα περιήγησής σας μετά την εκκίνηση του κουίζ, θα μετρηθεί ως μια άλλη προσπάθεια.
sl_si: Pazite: Klik "osveži" ali uporaba tipk za naprej oziroma nazaj na vašem brskljalniku po tem ko že začnete preverjanje znanja se bo štela kot nov poskus.

source: Click here to start the quiz
el: Κάντε κλικ εδώ για να ξεκινήσετε το τεστ
sl_si: Kliknite tukaj, da začnete test

source: Number of times you have taken this test :
el: Αριθμός προσπαθειών σας σε αυτό το τεστ :
sl_si: Število poskusov opravljanja tega testa:

source: Your highest acheaved score:
el: Το υψηλότερο σκορ σας:
sl_si: Najvišji dosežen rezultat

source: This quiz will submit in
el: Αυτό το τεστ θα υποβληθεί σε
sl_si: Ta test bo predložen

source: Submit answers
el: Υποβολή απαντήσεων
sl_si: Predloži odgovore

source: Sorry! There appears to have been a problem submitting this quiz.<br/>Perhaps you accidently pressed the "back" button.
el: Συγνώμη! Φαίνεται ότι υπήρξε πρόβλημα κατά την υποβολή αυτού του τεστ. <br/> Ίσως πατήσατε κατά λάθος το κουμπί "πίσω".
sl_si: Ups! Prišlo je do težav pri predložitvi tega testa. Mogoče ste po nesreči pritisnili tipko "nazaj".

source: Thank you.
el: Σας ευχαριστούμε.
sl_si: Hvala.

source: Scroll down to check your answers and final score.
el: Παρακάτω μπορείτε να δείτε τις απαντήσεις σας και την τελική σας βαθμολογία.
sl_si: Z miško se pomaknite navzdol, da preverite vaše odgovore in končni rezultat

source: Total number of correct anwers:
el: Συνολικός αριθμός σωστών απαντήσεων:
sl_si: Skupno število pravilnih odgovorov:

source: Your score on this attempt:
el: Η βαθμολογία σας σε αυτή την προσπάθεια:
sl_si: Oglej si rezultat tega poskusa:

source: A Participant has taken the quiz:
el: Ένας εξεταζόμενος ξεκίνησε το τεστ:
sl_si: Sodelujoči je opravil test

source: Date Taken:
el: Ημερομηνία:
sl_si: Datum opravljanja

source: This message has been generated automatically
el: Αυτό το μήνυμα έχει δημιουργηθεί αυτόματα
sl_si: To sporočilo je bilo ustvarjeno samodejno

source: Quiz name:
el: Όνομα τεστ:
sl_si: Ime testa

source: This e-mail is a receipt of your quiz results for
el: Αυτό το email είναι μια σύνοψη των αποτελεσμάτων του τεστ σας για
sl_si: Ta e-pošta je potrdilo vaših rezultatov testa za

source: Blank
el: Κενό
sl_si: Prazen prostor

source: Possible Correct Answers
el: Πιθανές Σωστές Απαντήσεις
sl_si: Možen pravilni odgovor

source: No answer given
el: Δεν έχει δοθεί απάντηση
sl_si: Nobenega danega odgovora

source: Your answer:
el: Η απάντησή σας:
sl_si: Vaš odgovor:

source: Check Answer
el: Έλεγχος Απάντησης
sl_si: Preveri odgovor

source: Finish Date
el: Ημερομηνία ολοκλήρωσης
sl_si: Končni datum

source: You have not yet attempted this quiz
el: Δεν έχετε καταγεγραμμένες προσπάθειες σε αυτό το τεστ, προς το παρόν
sl_si: Tega testa še niste poskusili

source: Leaderboard
el: Πίνακας Βαθμολογίας
sl_si: Najboljši dosežki

source: Attempts
el: Προσπάθειες
sl_si: Poskusi

source: Anonymous User
el: Ανώνυμος Χρήστης
sl_si: Anonimni uporabnik

source: Question Pot created
el: Έχει δημιουργηθεί τράπεζα ερωτήσεων

source: Question Pot Name cannot be blank
el: Το όνομα της τράπεζας ερωτήσεων δεν μπορεί να είναι κενό

source: Question Pot Name Edited
el: Το όνομα της τράπεζας ερωτήσεων έχει επεξεργαστεί

source: Add possible answer
el: Προσθήκη πιθανής απάντησης
sl_si: Dodaj možen odgovor

source: Current Possible Answers
el: Τρέχουσες πιθανές απαντήσεις
sl_si: Trenutni možni odgovori

source: Answers are NOT case sensitive
el: Στις απαντήσεις δεν γίνεται διάκριση πεζών-κεφαλαίων
sl_si: Odgovori niso pogojeni z rabo velikih ali malih črk

source: Add a new response option
el: Προσθέστε μια νέα επιλογή απάντησης
sl_si: Dodaj novo možnost odgovora
