<div class="wrap">
<h1><?php _e('Help') ?></h1>
<div class="tab" style="float: left; width:30%;">

	<a id="nav-overview" onclick="openTab(event, 'overview')">
	<h3  class="nav-tab">Επισκόπηση</h3></a>
	<a onclick="openTab(event, 'started')">
	<h3 class="nav-tab">Ξεκινώντας : Δημιουργία καταλόγου ερωτήσεων</h3></a>
	<a onclick="openTab(event, 'questions')">
	<h3 class="nav-tab">Δημιουργία ερωτήσεων</h3></a>
	<a onclick="openTab(event, 'question_feedback')">
	<h3 class="nav-tab">Ανατροφοδότηση ερωτήσεων</h3></a>
	<a onclick="openTab(event, 'insertQuestion')" >
	<h3 class="nav-tab">Προσθήκη ερώτησης σε σελίδα</h3></a>
	<a onclick="openTab(event, 'quiz')" >
	<h3 class="nav-tab">Δημιουργία εξετάσεων</h3></a>
	<a onclick="openTab(event, 'insertQuiz')">
	<h3 class="nav-tab">Προσθήκη εξέτασης σε σελίδα</h3></a>
	<a onclick="openTab(event, 'shortcodes')">
	<h3 class="nav-tab">Shortcodes</h3></a>
	<a onclick="openTab(event, 'showResponse')">
	<h3 class="nav-tab">Εμφάνιση απαντήσεων χρηστών</h3></a>
	<a onclick="openTab(event, 'results')" >
	<h3 class="nav-tab">Προβολή αποτελεσμάτων</h3></a>
	<a onclick="openTab(event, 'more_help')">
	<h3 class="nav-tab">Περισσότερη Βοήθεια</h3></a>

</div>
<div id="overview" class="tab-content" style="float: right; width:66%;" >

<h2>Επισκόπηση</h2>
<p> Αυτό το πρόσθετο σας επιτρέπει να δημιουργήσετε ερωτήσεις κουίζ και να τις εντάξετε σε μια σελίδα ένα άρθρο ή να δημιουργήσετε μια ολοκληρωμένη εξέταση</p>
<p> Οι ερωτήσεις αποθηκεύονται σε καταλόγους που σας επιτρέπουν να δημιουργήσετε προσαρμοσμένα κουίζ από διαφορετικές ερωτήσεις σε κάθε κατάλογο. Μπορείτε να φανταστείτε έναν κατάλογο ως αποθετήριο στο οποίο αποθηκεύετε παρόμοιες ερωτήσεις, για παράδειγμα, θα μπορούσατε να έχετε 3 καταλόγους ερωτήσεων με το όνομα 'Εύκολες', 'Μέτριες' και 'Δύσκολες'. Στη συνέχεια, μπορείτε να δημιουργήσετε ένα κουίζ με 5 ερωτήσεις από τον κατάλογο  'Εύκολες', 5 ερωτήσεις από τον κατάτλογο με τις Μέτριες και 5 ερωτήσεις από τον κατάλογο με τις δύσκολες ερωτήσεις. </p>
<p> Οι ερωτήσεις τηε εξέτασης έχουν εκχωρηθεί τυχαία στο παραπάνω παράδειγμα, αν είχατε 10 ερωτήσεις σε κάθε κατάλογο, θα εμφανίζονταν 15 τυχαίες ερωτήσεις, 5 από κάθε δυσκολία σε κάθε άτομο που εξετάζεται (βλ. παρακάτω) </p>
<?php
//echo home_url();
$homeURL =  network_home_url();

if($homeURL =="")
{
	$homeURL = home_url();	
}

$imgSrc =  $homeURL.'/wp-content/plugins/quiz-tool-lite/admin/help/pot-example-el.jpg';
//echo $imgSrc;

echo '<div style="text-align:center"><img src="'.$imgSrc.'" />';
echo '<br/><span class="greyText">Ένα παράδειγμα που δείχνει ένα κουίζ που αποτελείται από 2 ερωτήσεις επιλεγμένες τυχαία από 3 καταλόγους.</span>';
echo '</div>';

?>

</div>
<div id="started" class="tab-content" style="float: right; width:66%;">

<h2>Ξεκινώντας : Δημιουργία καταλόγου ερωτήσεων</h2>
<p>Αρχικά πρέπει να δημιουργήσετε έναν κατάλογο ερωτήσεων στον οποίο θα προσθέσετε τις ερωτήσεις σας. Κάντε κλικ στο 'Κατάλογος Ερωτήσεων' από το μενού και, στη συνέχεια, 'Δημιουργία νέου καταλόγου ερωτήσεων'</p>
<p>Μπορείτε να ονομάσετε τον κατάλογό σας όπως θέλετε, π.χ. «Γεωγραφικές ερωτήσεις». Το όνομα αυτό δεν εμφανίζεται στους χρήστες που εξετάζονται σε ερωτήσεις από τον κατάλογο αυτόν.</p>
<p>Επίσης, μπορείτε να αλλάξετε το όνομα του καταλόγου οποιαδήποτε στιγμή</p>
Μόλις δημιουργήσετε έναν κατάλογο ερωτήσεων, κάντε κλικ στο κουμπί "Προσθήκη / επεξεργασία ερωτήσεων" για να ξεκινήσετε να προσθέτετε ερωτήσεις.
</div>
<div id="questions" class="tab-content" style="float: right; width:66%;">

<h2>Δημιουργία ερωτήσεων</h2>
<p>Αφού δημιουργήσετε έναν κατάλογο ερωτήσεων, κάντε κλικ στο κουμπί "Προσθήκη / επεξεργασία ερωτήσεων" για να ξεκινήσετε να προσθέτετε ερωτήσεις. Επιλέγοντας το κουμπί "Προσθέστε μια νέα ερώτηση" μετα΄φερεστε σε μια σελίδα που σας ζητά να επιλέξετε τύπο ερώτησης. Υπάρχουν 5 τύποι ερωτήσεων για να διαλέξετε.</p>

<b>Πολλαπλής επιλογής μιας απάντησης (Radio Buttons)</b><br/>
<p>Αυτός ο τύπος ερώτησης επιτρέπει στους εξεταζόμενους να επιλέξουν ΜΙΑ και μόνο μία απάντηση. Χρησιμοποιήστε το για να δημιουργήσετε ερωτήσεις Σωστό / Λάθος ή όταν υπάρχει μόνο μία απάντηση, π.χ. Ποια είναι η πρωτεύουσα της Γαλλίας.</p>

<b>Πολλαπλής επιλογής πολλών απαντήσεων (check boxes)</b><br/>
<p>Αυτός ο τύπος ερωτήσης επιτρέπει στους εξεταζόμενους να επιλέγουν περισσότερες από μία απαντήσεις, π.χ. ποιο από τα παρακάτω είναι αληθές / επιλέξτε όλα όσα ισχύουν.</p>

<b>Κειμένο</b><br/>
<p>Αυτός ο τύπος ερώτησης επιτρέπει στους εξεταζόμενους να προσθέτουν κείμενο σε ένα πλαίσιο. Μπορείτε να προσδιορίσετε όσες σωστές απαντήσεις επιθυμείτε. Σα πεδία δεν γίονεται διάκριση πεζών/κεφαλαίων. Δηλαδή  το "Ρήμα" θα γίνονταν αποδεκτό και ως "ρήμα".</p>

<b>Κρίσεως (χωρίς textbox)</b>
<p>Μπορείτε να χρησιμοποιήσετε αυτόν τον τύπο ερώτησης όταν θέλετε να δώσετε στους εξεταζόμενους μια πρόταση ή ιδέα για να σκεφτούν και, στη συνέχεια, κάνοντας κλικ σε ένα κουμπί για να αποκαλύψουν την απάντηση.
Αυτός ο τύπος ερωτήματος «κλικ για αποκάλυψη» απλώς παρουσιάζει πληροφορίες στους εξεταζόμενους και δεν δίνει κανένα μέσο για να εισαγάγουν κάποια απάντηση.</p>

<b>Κρίσεως (με textbox)</b>
<p>
Αυτός ο τύπος ερωτήματος λειτουργεί με τον ίδιο τρόπο όπως παραπάνω (κάντε κλικ για να αποκαλύψετε μια απάντηση), αλλά επίσης επιτρέπει στους μαθητές να πληκτρολογήσουν μια δικιά τους απάντηση πριν αποκαλύψουν την απάντηση.
Μπορείτε να χρησιμοποιήσετε αυτόν τον τύπο ερώτησης για να συλλέξετε πληροφορίες από τους συμμετέχοντες και στη συνέχεια σε μια μεταγενέστερη σελίδα να παρουσιάσετε την αρχική τους απάντηση. Δείτε περισσότερα γι αυτό στο παράρτημα που αφορά τα <a href="#shortcodes">'shortcodes'</a>.</p>

</div>
<div id="question_feedback" class="tab-content" style="float: right; width:66%;">

<h2>Ανατροφοδότηση ερωτήσεων</h2>
<p>Κάθε ερώτηση έχει αρκετές επιλογές για την παροχή ανατροφοδότηση. Υπάρχει σωστό και εσφαλμένο πλαίσιο ανάδρασης, αλλά κάθε επιλογή απάντησης (αν υπάρχει) μπορεί επίσης να έχει ανατροφοδότηση για σωστή και εσφαλμένη απάντηση.</p>
<p>Η ανατροφοδότηση δεν είναι απαραίτητη και μπορεί να αφεθεί κενή. Δίνεται αυτόματα όταν προσθέτετε μια μόνο ερώτηση - δεν χρειάζεται να την ενεργοποιείτε με κάποιο τρόπο.</p>

</div>
<div id="insertQuestion" class="tab-content" style="float: right; width:66%;">

<h2>Προσθήκη ερώτησης σε σελίδα</h2>
<p>Προσθέστε μια ερώτηση σε σελίδα χρησιμοποιώντας το εικονίδιο του οδηγού Quiz Tool Lite. Μπορείτε να το βρείτε στην γραμμή εργαλείων του επεξεργαστή κειμένου του WordPress (βλ. παρακάτω)</p>
<?php
$imgSrc =  $homeURL.'/wp-content/plugins/quiz-tool-lite/admin/help/question-add-el.jpg';
echo '<div style="text-align:center"><img src="'.$imgSrc.'" />';
echo '<br/><span class="greyText">Κατά την επεξεργασία μιας σελίδας ή ενός άρθρου πατήστε το εικονίδιο με το γράμμα Q για να προσθέσετε εξέταση ή ερώτηση.</span>';
echo '</div>';
?>

<p>Όταν κάνετε κλικ στο εικονίδιο, θα εμφανιστεί ένα αναδυόμενο παράθυρο στο οποίο μπορείτε να επιλέξετε είτε μια εξέταση είτε μια ερώτηση που θα εισαχθεί στη σελίδα. Αρχικά, επιλέξτε τον κατάλογο που περιέχει τις ερωτήσεις, στη συνέχεια κάντε κλικ στην ερώτηση και στο "Εισαγωγή στη σελίδα". Με αυτόν τον τρόπο θα εισαχθεί ένας shortcode στη σελίδα.</p>

</div>
<div id="quiz" class="tab-content" style="float: right; width:66%;">

<h2>Δημιουργία εξετάσεων</h2>
<p>Μια εξέταση δημιουργείται παίρνοντας έναν αριθμό ερωτήσεων από τους επιλεγμένους καταλόγους ερωτήσεων. Σε μια απλή περίπτωση, αν είχατε έναν κατάλογο με δέκα ερωτήσεις, θα μπορούσατε να δημιουργήσετε μια εξέταση που θα "τραβούσε" 10 ερωτήσεις από αυτόν τον κατάλογο. Αυτό θα δημιουργούσε μια εξέταση με τις 10 ερωτήσεις να εμφανίζονται τυχαία. Ωστόσο, μπορείτε να συνδυάσετε πολλαπλές ερωτήσεις από ξεχωριστούς καταλόγους, ώστε κάθε εξεταζόμενος να δει μια ελαφρώς διαφορετική έκδοση της εξέτασης.</p>
<p>Τα αποτελέσματα των εξετάσεων για εγγεγραμμένους χρήστες αποθηκεύονται και μπορούν να προβληθούν ανά εξέταση και εξεταζόμενο. Επίσης μπορούν να εξαχθούν σε αρχεία μορφής CSV.</p>

</div>

<div id="insertQuiz" class="tab-content" style="float: right; width:66%;">

<h2>Προσθήκη εξέτασης σε σελίδα</h2>
<p>Χρησιμοποιήστε των οδηγό εισαγωγής ερωτήσεων και εξετάσεων από την γραμμή εργαλείων του επεξεργαστή κειμένου του WordPress κατά την επεξεργασία μιας σελίδας όπως έχει αναφερθεί παραπάνω. Επίσης μπορείτε να χρησιμποιήσετε απευθείας ένα shortcode.</p>

</div>
<div id="shortcodes" class="tab-content" style="float: right; width:66%;">

<h2>Shortcodes</h2>
<p>Η προσθήκη ερωτήσεων και εξετάσεων σε σελίδες γίνεται με την χρήση 'shortcodes'. Το shortcode είναι ένα μικρό απόσπασμα κώδικα που εσωκλείεται από αγκύλες, για παράδειγμα : [My Shortcode].</p>
Για να χρησιμποιήσετε τα shortcodes δεν χρειάζονται κάποιες επιπλέον τεχνικές γνώσεις. Απλά χρησιμοποιήστε τον οδηγό εισαγωγής ερωτήσεων και εξετάσεων και όλα τα απαραίτητα shortcodes θα δημιουργηθούν αυτόματα.
<p>Παραδείγματα shortcodes μπορείτε να δείτε παρακάτω.</p>

<h4>Παραδείγματα Shortcode</h4>
<table style="line-height:50px; text-align:left; border-bottom:1px solid #ccc">
<tr>
<th width="350px">Shortcode</th>
<th>Περιγραφή</th>
</tr>
<tr>
<td>
<span class="codeExample">[QTL-Question id=25]</span>
</td>
<td>
Εισαγωγή ερώτησης με ID = 25
</td>
</tr>
<tr>
<td>
<span class="codeExample">[QTL-Question id=25 savedata=true]</span>
</td>
<td>
Εισαγωγή ερώτησης με ID = 25 και αποθήκευση απάντησης στη βάση δεδομένων
</td>
</tr>
<tr>
<td>
<span class="codeExample">[QTL-Question id=25 button="Κλικ εδώ!"]</span>
</td>
<td>
Εισαγωγή ερώτησης με ID = 25 και παραμετροποίηση κειμένου κουμπιού "Υποβολή απάντησης"
</td>
</tr>

<tr>
<td>
<span class="codeExample">[QTL-Question id=25 correctfeedback="Μπράβο!"]</span>
</td>
<td>
Εισαγωγή ερώτησης με ID = 25 και παραμετροποίηση της προεπιλεγμένης ανατροφοδότησης
</td>
</tr>

<tr>
<td><span class="codeExample">[QTL-Response id=25]</span></td>
<td>Εμφανίζει την απάντηση που δόθηκε στο ερώτημα με ID 25 από τον τρέχοντα συνδεδεμένο χρήστη</td>
</tr>
<tr>
<td><span class="codeExample">[QTL-Quiz id=2]</span></td>
<td>Εισαγωγή εξέτασης με ID 2 στη σελίδα</td>
</tr>
<tr>
<tr>
<td valign="top"><span class="codeExample">[QTL-Score id=2]</span></td>
<td>Εμφανίζει τον αριθμό των προσπαθειών και τη μέγιστη βαθμολογία για την εξέταση ID 2 στον τρέχοντα συνδεδεμένο χρήστη <br/> Προαιρετικό - προσθέστε "showall = true" στο shortcode για να εμφανίσετε όλες τις βαθμολογίες απόπειρας</td>
</tr>
<tr>
<td><span class="codeExample">[QTL-Leaderboard id=2]</span></td>
<td>Προβολή πίνακα αποτελεσμάτων που δείχνει όλες τις βαθμολογίες χρηστών για την εξέταση με ID 2</td>
</tr>
<tr>
<td><span class="codeExample">[QTL-Leaderboard id=2 anonymous=true]</span></td>
<td>Προβολή πίνακα αποτελεσμάτων που δείχνει όλες τις βαθμολογίες χρηστών για την εξέταση με ID 2 αλλά κρύβει τα ονόματά τους</td>
</tr>

</table>

<h4>Shortcodes διαθέσιμα για μεμονωμένες ερωτήσεις [QTL-Question]</h4>
<table style="line-height:50px; text-align:left; border-bottom:1px solid #ccc">

<tr>
<td><span class="codeExample">savedata=true</span></td>
<td>Αποθηκεύει την απάντηση στη βάση δεδομένων ώστε να μπορείτε να εμφανίσετε στο χρήστη σε άλλη σελίδα</td>
</tr>

<tr>
<td><span class="codeExample">button="Κλίκ εδώ!"</span></td>
<td>Αλλάζει το προεπιλεγμένο κείμενο κουμπιού απάντησης</td>
</tr>

<tr>
<td><span class="codeExample">correctfeedback="Μπράβο!"</span></td>
<td>Αλλάζει το προεπιλεγμένο μήνυμα για σωστή απάντηση</td>
</tr>

<tr>
<td><span class="codeExample">incorrectfeedback="Αυτό είναι λάθος!"</span></td>
<td>Αλλάζει το προεπιλεγμένο μήνυμα για λάθος απάντηση</td>
</tr>

<tr>
<td><span class="codeExample">iconset=3</span></td>
<td>Αλλάζει το προεπιλεγμένο σετ εικονιδίων. <a href="javascript:toggleLayerVis('iconsets')">Προβολή εικονιδίων</a></td>
</tr>
</table>

<div id="iconsets" style="display:none">
<h3>Διαθέσιμα εικονίδια (Icon Sets)</h3>
<?php

$iconArray = array();
$iconArray = qtl_utils::getQTL_IconArray();

$correctIconDir = QTL_PLUGIN_URL.'/images/icons/correct/';
$incorrectIconDir = QTL_PLUGIN_URL.'/images/icons/incorrect/';
echo '<table>';
$i=1;
foreach($iconArray as $myIcon)
{
	$currentIconNo = substr($myIcon, 4, -4);
	$correctIconRef = $correctIconDir.'/'.$myIcon;
	$incorrectIconRef = $incorrectIconDir.'/cross'.$currentIconNo.'.png';
	if($i==1){echo '<tr>';}
	echo '<td align="center" style="padding:25px">';
	echo '<img src="'.$correctIconRef.'">';
	echo '<img src="'.$incorrectIconRef.'"><br/>';
	echo 'Iconset '.$currentIconNo;
	if($currentIconNo==1){echo ' (Default)';}
	echo '</td>';
	$i++;
	if($i>=5){$i=1; echo '</tr>';}
}
if($i<>1){echo '</tr>';}
echo '</table>';
?>  

</div>
</div>
<div id="showResponse" class="tab-content" style="float: right; width:66%;">

<h2>Εμφάνιση απαντήσεων χρηστών</h2>
<p>Είναι δυνατό να προβληθεί στους συμμετέχοντες μια απάντηση που έδωσαν σε μια προηγούμενη συνεδρία. Αυτό είναι ιδιαίτερα χρήσιμο για τους τύπους ερωτήσεων κρίσεως εάν επιθυμείτε να εμφανίσετε τις απαντήσεις τους σε αυτές σε μεταγενέστερο στάδιο.</p>
<p>Για να γίνει αυτό χρειάζεστε τα παρακάτω:</p>
<p><b>1. Βεβαιωθείτε ότι τα δεδομένα αποθηκεύονται με χειροκίνητη τροποποίηση του shortcode </b>
Ένα τυπικό shortcode για μια ερώτηση έχει ως εξής:</p>

<span class="codeExample">[QTL-Question id=25]</span>
<p>Για να κάνετε την ερώτηση να αποθηκεύσει δεδομένα απαντήσεων απλώς προσθέστε 'savedata = true' στο shoprtcode όπως φαίνεται παρακάτω</p>

<span class="codeExample">[QTL-Question id=25 savedata=true]</span>

<p><b>2. Προσθήκη shortcode για εμφάνιση απάντησης</b>
Για να εμφανίσετε την απάντηση που υποβλήθηκε για ερώτηση με ID25, προσθέστε τα παρακάτω στη σελίδα ή το άρθρο σας σας</p>

<span class="codeExample">[QTL-Response id=25]</span>

<p><i>Λάβετε υπόψη ότι αυτή τη στιγμή υποστηρίζεται μόνο σε τύπους ερωτήσεων κρίσεως (πλαίσια κειμένου) και μόνο με μεμονωμένες ερωτήσεις, όχι σε εξετάσεις.</i></p>

</div>
<div id="results" class="tab-content" style="float: right; width:66%;">

<h2>Προβολή αποτελεσμάτων</h2>
<p>Η σελίδα αποτελεσμάτων εμφανίζει μια λίστα από κουίζ που έχετε δημιουργήσει. Κάνοντας κλικ στο σύνδεσμο "Προβολή αποτελεσμάτων" θα εμφανιστούν όλοι οι εγγεγραμμένοι χρήστες στην εξέταση, καθώς και ο υψηλότερος βαθμός τους.</p>
<p>Σημειώστε ότι αν δεν ορίσετε περιοριμό οι εξεταζόμενοι θα μπορούν να προσπαθήσουν όσες φορές επιθυμούν και μόνο η υψηλότερη βαθμολογία θα καταγραφεί ως τελικό αποτέλεσμα.</p>

</div>
<div id="more_help" class="tab-content" style="float: right; width:66%;">

<h2>Χρειάζεστε περισσότερη βοήθεια;</h2>
<p>Αν χρειάζεστε περισσότερη βοήθεια μπορείτε να απευθυνθείτε στο <a href="http://wordpress.org/support/plugin/quiz-tool-lite
">φόρουμ υποστήριξης</a>  του αρχικού δημιουργού ή να ανοίξετε issue στην <a href="https://github.com/ir4klis/quiz-tool-lite
" target="_blank">σελίδα</a> αυτής της παραλλαγής του προσθέτου στο GitHub.</p>

</div>
</div>

<script>
function openTab(evt, tabName) {

	var i, tabcontent, tablinks;
	tabcontent = document.getElementsByClassName("tab-content");
	for (i = 0; i < tabcontent.length; i++) {
		tabcontent[i].style.display = "none";
	}
	tablinks = document.getElementsByClassName("nav-tab");
	for (i = 0; i < tablinks.length; i++) {
		tablinks[i].className = tablinks[i].className.replace(" nav-tab-active", "");
	}
	document.getElementById(tabName).style.display = "block";
	evt.currentTarget.className += " nav-tab-active";

	//event.preventDefault();
}

// Get the element with id="nav-overview" and click on it
document.getElementById("nav-overview").click();
</script>

<style>
	.nav-tab {
    display: block;
    width: 100%;
    margin: 0;
}

    table tbody tr td:nth-child(1) {
        width: 55%;
    }

    table tbody tr td:nth-child(2) {
       line-height: 1.5;
   }
</style>